{
  "0": "No error.",
  "1": "User name or password error.",
  "2": "Not authorized to do this operation.",
  "3": "SDK is not initialized.",
  "4": "Channel number error. There is no corresponding channel number on the device.",
  "5": "The number of connection with the device has exceeded the max limit.",
  "6": "Version mismatch. SDK version is not matching with the device.",
  "7": "Failed to connect to the device. The device is off-line, or connection timeout caused by network.",
  "8": "Failed to send data to the device.",
  "9": "Failed to receive data from the device.",
  "10": "Timeout when receiving data from the device.",
  "11": "The data sent to the device is illegal, or the data received from the device error.  E.g. The input data is not supported by the device for remote configuration.",
  "12": "API calling order error.",
  "13": "Not authorized for this operation.",
  "14": "Executing command on the device is timeout.",
  "15": "Serial port number error. The assigned serial port does not exist on the device.",
  "16": "Alarm port number error.",
  "17": "Parameter error. Input or output parameters in the SDK API is NULL, or the value or format of the parameters does not match with the requirement.",
  "18": "Device channel is in exception status.",
  "19": "No hard disk on the device, and the operation of recording and hard disk configuration will fail.",
  "20": "Hard disk number error. The assigned hard disk number does not exist during hard disk management.",
  "21": "Device hark disk is full.",
  "22": "Device hard disk error.",
  "23": "Device does not support this function.",
  "24": "Device is busy.",
  "25": "Failed to modify device parameters.",
  "26": "The inputting password format is not correct.",
  "27": "Hard disk is formatting, and the operation cannot be done.",
  "28": "Not enough resource on the device.",
  "29": "Device operation failed.",
  "30": "Failed to collect local audio data or to open audio output during voice talk / broadcasting.",
  "31": "Voice talk channel on the device has been occupied.",
  "32": "Time input is not correct.",
  "33": "There is no selected file for playback.",
  "34": "Failed to create a file, during local recording, saving picture, getting configuration file or downloading record file.",
  "35": "Failed to open a file. ",
  "36": "The last operation has not been completed.",
  "37": "Failed to get the current played time.",
  "38": "Failed to start playback.",
  "39": "The file format is not correct.",
  "40": "File directory error.",
  "41": "Resource allocation error.",
  "42": "Sound adapter mode error. Currently opened sound playing mode does not match with the set mode.",
  "43": "Buffer is not enough.",
  "44": "Create SOCKET error.",
  "45": "Set SOCKET error",
  "46": "The number of login or preview connections has exceeded the SDK limitation.",
  "47": "User doest not exist. The user ID has been logged out or unavailable. ",
  "48": "Writing FLASH error. Failed to write FLASH during device upgrade.",
  "49": "Failed to upgrade device. It is caused by network problem or the language mismatch between the device and the upgrade file. ",
  "50": "The decode card has alreadly been initialed.",
  "51": "Failed to call API of player SDK.",
  "52": "The number of login user has reached the maximum limit.",
  "53": "Failed to get the IP address or physical address of local PC.",
  "54": "This channel hasn't started encoding.",
  "55": "IP address not match",
  "56": "MAC address not match",
  "57": "The language of upgrading file does not match the language of the device.",
  "58": "The number of player ports has reached the maximum limit.",
  "59": "No enough space to backup file in backup device.",
  "60": "No backup device.",
  "61": "The color quality seeting of the picture does not match the requirement, and it should be limited to 24.",
  "62": "The dimension is over 128x256.",
  "63": "The size of picture is over 100K",
  "64": "Failed to load player SDK.",
  "65": "Can not find the function in player SDK.",
  "66": "Failed to load the library file-\"DsSdk\".",
  "67": "Can not find the API in \"DsSdk\".",
  "68": "Failed to call the API in \"DsSdk\".",
  "69": "Sound adapter has been monopolized.",
  "70": "Failed to join to multicast group.",
  "71": "Failed to create log file directory.",
  "72": "Failed to bind socket.",
  "73": "Socket disconnected. It is caused by network disconnection or destination unreachable.",
  "74": "The user ID is operating when logout.",
  "75": "Failed to listen",
  "76": "Sdk program exception",
  "77": "Failed to write file, during local recording, saving picture or downloading record file.",
  "78": "Failed to format read-only HD",
  "79": "This user name already exists in the user configuration structure.",
  "80": "Device type does not match when import configuration.",
  "81": "Language does not match when import configuration.",
  "82": "Software version does not match when import configuration.",
  "83": "IP channel is not on-line when previewing.",
  "84": "Load StreamTransClient.dll failed",
  "85": "Load SystemTransform.dll failed",
  "86": "over maximun ipc count",
  "87": "add label or other operation reach the maximum number",
  "88": "Image intensifier, parameter mode error. This error may occur when client sets software or hardware parameters. ",
  "89": "Code splitter is offline.",
  "90": "Device is backing up.",
  "91": "Channel not support",
  "92": "The height line location is too concentrated, or the length line is not inclined enough.",
  "93": "Cancel calibration conflict, if the rule and overall actual size filter have been set.",
  "94": "Calibration point exceeds the range.",
  "95": "The size filter does not meet the requirement.",
  "96": "Device has not registered to DDNS.",
  "97": "DDNS inner error.",
  "98": "This function don't support this OS.",
  "99": "Decode channel can not bind with two display channel.",
  "100": "Failed to load the audio intercom SDK from current directory.",
  "101": "No current upgrade pack.",
  "102": "The user has not logined the device.",
  "103": "It is using the log swtich file.",
  "104": "The ports used to bound in port pool is exhausted.",
  "105": "The packet type of stream is error.",
  "106": "IPID of IP access configuration is error.",
  "107": "Load Preview component Failed.",
  "108": "Load Voice talk component Failed.",
  "109": "Load Alarm component Failed.",
  "110": "Load Playback component Failed.",
  "111": "Load Display component Failed.",
  "112": "Load Industry component Failed.",
  "113": "Load general configuration management component failed.",
  "114": "Load configuration core component failed.",
  "121": "There is a mismatch between the component and core version.",
  "122": "There is a mismatch  between Live view component and core version.",
  "123": "There is a mismatch  between voice component and core version.",
  "124": "There is a mismatch  between alarm component and core version.",
  "125": "There is a mismatch  between playback component and core version.",
  "126": "There is a mismatch  between display component and core version.",
  "127": "There is a mismatch  between industrial application component and core version.",
  "128": "There is a mismatch  between general configuration management component and the core version.",
  "136": "There is a mismatch  between Live view component and HCNetSDK version.",
  "137": "There is a mismatch  between voice component and HCNetSDK version.",
  "138": "here is a mismatch  between alarm component and HCNetSDK version.",
  "139": "There is a mismatch  between playback component and HCNetSDK version.",
  "140": "There is a mismatch  between display component and HCNetSDK version.",
  "141": "There is a mismatch  between industrial application component and HCNetSDK version.",
  "142": "There is a mismatch  between General configuration management component and the HCNetSDK version.",
  "150": "Alias is duplicate (for HiDDNS)",
  "152": "The user name doesn't exist.",
  "153": "The user name is locked.",
  "154": "Invalid User ID.",
  "155": "The login version is too low.",
  "156": "Failed to load libeay32.dll.",
  "157": "Failed to load ssleay32.dll.",
  "158": "Failed to load libiconv.dll。",
  "165": "Failed to connect to test server.",
  "166": "Failed to mount to NAS server (No such directory, or user name/password error).",
  "167": "Failed to mount to NAS server (not authorized)",
  "168": "DNS has not been configured, so domain address may invalid.",
  "169": "GateWay of Email server has not been configured, so it may be failed to send mail.",
  "170": "User name and password tried to login the test server are not matching.",
  "171": "The connection between device and SMTP server is abnormal.",
  "172": "Failed to create directory in the FTP server.",
  "173": "Do not have permission to write in the FTP server.",
  "174": "IP conflict.",
  "175": "The storage pool is full.",
  "176": "The storage pool of cloud server is invalid, for not configure the storage pool or the ID of storage pool error.",
  "177": "Need reboot the device.",
  "178": "ANR arming is already established.",
  "179": "Upload Link is already established.",
  "180": "Incorrect file format.",
  "181": "Incorrect file content.",
  "182": "HRUDP limit the number of connections over equipment.",
  "200": "Existing name.",
  "201": "Number of arrays has reached its limit.",
  "202": "Number of virtual disks  has reached its limit.",
  "203": "Virtual disk slot is full.",
  "204": "Physical disk for rebuilding array is with error status.",
  "205": "Physical disk for rebuilding array is specified as spare drive.",
  "206": "Physical disk for rebuilding array is not idle.",
  "207": "Unable to migrate from the current array type to the new array type.",
  "208": "The migration operation has been paused.",
  "209": "The migration operation has been cancelled.",
  "210": "Operation failed! Please delete the virtual disk existed in the array first.",
  "211": "Target physical disk is part of the virtual disk and is functional.",
  "212": "Specified physical disk is assigned to a virtual disk",
  "213": "Number of physical disks doesn't fit the specified RAID level.",
  "214": "Specified virtual disk is functional.",
  "215": "BGA is running.",
  "216": "Can not create virtual disk with ATAPI drive.",
  "217": "Migration is not necessary.",
  "218": "Physical disks are not of the same type.",
  "219": "No virtual disk exist on the specified array.",
  "220": "Disk space is too small to be assigned as spare drive.",
  "221": "Disk is already assigned as a spare drive for an array.",
  "222": "Disk is missing from an array.",
  "223": "Name is empty.",
  "224": "The input parameter is error.",
  "225": "The physical disk is not available.",
  "226": "The RAID is not available",
  "227": "The count of physical disks is not correct.",
  "228": "Virtual disk is too small.",
  "229": "Not exist.",
  "230": "Not support the operation.",
  "231": "The status of RAID is abnormal.",
  "232": "The device node of virtual disk does not exist.",
  "233": "The count of slots reaches the upper limit.",
  "234": "There is not virtual disk in the RAID.",
  "235": "The slot of virtual disk is invalid.",
  "236": "The required space of physical disk  is not enough.",
  "237": "Only the RAID on normal state supports to be migrated.",
  "238": "The space of RAID is not enough.",
  "239": "It is pulling the disk out safely or rescanning the disk.",
  "240": "Not support create the RAID larger than 16T.",
  "250": "The device has not been activated.",
  "251": "There is a risk of the password.",
  "252": "The device has been activated.",
  "300": "Configuration ID is illegal.",
  "301": "Polygon does not match requirement.",
  "302": "Rule parameter is illegal.",
  "303": "Configuration conflict.",
  "304": "Calibration not ready.",
  "305": "Camera parameter is illegal.",
  "306": "Not tilt enough, not fit to calibrate.",
  "307": "Calibration error.",
  "308": "Failed to calculate camera calibration parameter.",
  "309": "The input calibrating line exceeds the external rectangle sample.",
  "310": "Enter rule not ready.",
  "311": "It does not include lane in the traffic event rule \n    (especial for traffic jam or driving against the traffic).",
  "312": "Lane not ready.",
  "313": " There are two different directions in event rule.",
  "314": "The lane conflicts with the data rule. ",
  "315": "The event type is not supported by the device.",
  "316": "The lane has no direction.",
  "317": "The size of filter is illegal.",
  "318": "There is no face when feature point positioning.",
  "319": "The input image is too small when feature point positioning.",
  "320": "The input image has no face when detecting face in single image.",
  "321": "Face is too small when building model.",
  "322": "Face image is of poor quality when building model.",
  "323": "Advanced parameter setting error.",
  "324": "Calibration sample size error, or data value error, or sample points beyond the horizon",
  "325": "The configured rules do not allow to cancel calibration.",
  "326": "Filter scale is out range.",
  "327": "Region is too big.",
  "328": "Trial overdue.",
  "329": "Config file conflict.",
  "330": "Feature points location is error in face recognition.",
  "331": "Image quality assessment is error in face recognition.",
  "332": "Feature extract &amp; match error in face recognition.",
  "333": "Detection confidence is too low in feature points location.",
  "334": "Confidence is too low in feature points location.",
  "335": "Size of model data error.",
  "336": "Model version is error.",
  "337": "Face detection error in face recognition.",
  "338": "Face attribute normalize error.",
  "339": "Pustream and softdog are mismatched.",
  "340": "Pustream device version is error.",
  "341": "The pustream has existence.",
  "342": "Failed to connect face retrieval device.",
  "343": "Storage space is insufficient.",
  "344": "Failed to connect database.",
  "345": "Username or password is error for database.",
  "346": "Failed to decode image.",
  "347": "Image resolution is unreasonable.",
  "348": "Channel work mode error.",
  "581": "详见：转封装库错误码",
  "717": "The scene is in use.",
  "780": "Equipment other resource-intensive function, cause the function could not be opened.",
  "800": "Network traffic is over device ability limit.",
  "801": "The video file is recording and can't be locked.",
  "802": "The hard disk capacity is too small and can not be formatted.",
  "803": "Unable to connect to the remote device.",
  "804": "It does not support add spare device to a spare device.",
  "805": "The backup disk is abnormal.",
  "806": "The count of spare devices has reached the maximum limit.",
  "807": "The spare device to be added is a working device.",
  "808": "The adding order is wrong, such as, to add the working device to the spare device before adding the spare device to the working device.",
  "809": "It does not support add working device to a working device.",
  "810": "The CVR server is abnormal.",
  "811": "The spare device is abnormal.",
  "812": "The working device to be added is a spare device.",
  "813": "The performance reaches the upper limit",
  "814": "The devcie to be added has existed.",
  "815": "Inquest resuming.",
  "816": "Record backuping.",
  "817": "Disk playing.",
  "818": "Inquest started.",
  "819": "Local operating.",
  "820": "Inquest not start.",
  "821": "Chan bind aduio error or no bind.",
  "822": "Not support to set cloud storage mode, for the device is in N+1 mode.",
  "823": "The cloud storage mode has been opened.",
  "824": "Fot the device has been taken over, the operation is not allowed.",
  "825": "Fot the device has been taken over, it requires to get the redirection information and then re-operate.",
  "830": "The IR output error.",
  "831": "The command of IR output is not correct.",
  "832": "The device is not inquestiong.",
  "833": "The device is not in paused status.",
  "834": "Check the password mistake.",
  "835": "Check the password do not NULL.",
  "836": "Unable to calibrate currently.",
  "837": "Please finish the calibration first.",
  "838": "No panorama image for PanoVu camera calibration in flash.",
  "839": "Calibration failed. Please calibrate again.",
  "840": "Please set detection line again. The detection line should be within the red count area.",
  "843": "Exceed face images error.",
  "844": "Analysis face picture error.",
  "845": "Alarm Input No. A&lt;-1 is used to trigger vehicle capture.",
  "846": "Face lib database error.",
  "847": "Face libary data error.",
  "848": "Face data ID error.",
  "849": "Face libary ID error.",
  "850": "Face exceed face libary error.",
  "851": "Picture analysis no target error.",
  "852": "Subpicture analysis modeling error.",
  "853": "Picture Analysis no resource error.",
  "854": "Analysis engines no resource error.",
  "855": "Analysis engines usage exceed error.",
  "856": "Exceed human misinfo filter enabled max channel number error.",
  "857": "Name error.",
  "858": "Name exist error.",
  "859": "Face lib picture importing error.",
  "864": "Picture format error.",
  "865": "Picture resolution invalid error.",
  "866": "Picture size exceed.",
  "867": "Picture target num exceed.",
  "868": "Engine loading error.",
  "869": "Engine abnorma.",
  "870": "Analysis engine is import face library.",
  "871": "No data for modeling error.",
  "872": "face data modeling error.",
  "873": "face lib data over limit.",
  "874": "Analysis engine has been associated channel.",
  "875": "CustomID length error.",
  "876": "CustomFaceLibID repeat.",
  "877": "CustomHumanID Repeat.",
  "878": "URL download fail.",
  "879": "URL not start download.",
  "880": "Config file secret key error.",
  "901": "Window channel index error.",
  "902": "Window layer number error(the count of window layers on a single screen exceeds the max number).",
  "903": "Window block number error(the count of screens that single window overlays exceeds the max number).",
  "904": "The output resolution error.",
  "905": "Layout index error.",
  "906": "The input resolution is not supported.",
  "907": "The sub-device is off-line.",
  "908": "There is no free decoding channel.",
  "909": "The upper limit of window number.",
  "910": "Calling order error.",
  "911": "Be playing plan.",
  "912": "Decoder board is in use.",
  "913": "The data of output board is over the limit.",
  "914": "The user name is duplicate.",
  "915": "Invalid username.",
  "916": "The input matrix is in use.",
  "917": "The channel type is error (the output channel of matrix is different with the input of controller)",
  "918": "The input channel has been bound by other matrix.",
  "919": "The number of the matrix output channels in use has exceeded the number of channels bound with controller.",
  "920": "The number of input signal sources is over the limit.",
  "921": "The input channel is in use.",
  "922": "The operation failed, for the manager has logged in.",
  "923": "The operation failed, for the user has logged in.",
  "924": "The operation failed, for the layout is being initialized.",
  "925": "The size of traced drawing not match",
  "926": "The operation failed, for the window is performing other operation.",
  "927": "The number of windows has reached the maximum limit.",
  "943": "The window size exceeds the limit.",
  "951": "The number of windows overlap has reached the maximum limit.",
  "952": "stream ID and channel number are both valid.",
  "953": "The device has no zero channel.",
  "955": "Need redirection (for transcoding system)",
  "956": "The stream ID does not exist.",
  "957": "The transcoding has not been started.",
  "958": "The number of stream ID has reached the maximum limit.",
  "959": "The work mode does not match with the requirement.",
  "960": "It Has been working in current mode.",
  "961": "The device is in processing",
  "962": "It is in transcoding.",
  "975": "Wrong window position.",
  "976": "Screen distance exceeds the limit.",
  "984": "Operation failed. Close the window first.",
  "985": "Beyond the cycle decoding capacity.",
  "986": "Invalid cycle decoding time.",
  "987": "No more linked camera can be added.",
  "1000": "Not support to get this node of the capability set.",
  "1001": "The output buffer is not enough",
  "1002": "Can not find the corresponding xml file.",
  "1003": "Failed to load the local xml file.",
  "1004": "Data format of the capability is wrong.",
  "1005": "The type of capability set is wrong.",
  "1006": "Format of XML capability node is wrong.",
  "1007": "The input value of XML capability node is wrong.",
  "1008": "XML version not match",
  "1101": "The operation is failed, for transparent channel has been opened.",
  "1102": "The device is upgrading.",
  "1103": "The type of upgrade package not match.",
  "1104": "The device is being formatted.",
  "1105": "The version of upgrade package not match.",
  "1106": "The device PT has been locked.",
  "1111": "Verification Code illegal.",
  "1112": "Verification Code missing.",
  "1113": "This IP address has been banned, do not allow the configuration.",
  "1201": "The device is searching for the external module.",
  "1202": "The device is registering to the external module.",
  "1203": "The device is getting defense zone parameters.",
  "1204": "The device is getting triggers.",
  "1205": "The system is armed.",
  "1206": "The system is in programming mode.",
  "1207": "The system is in pacing mode.",
  "1208": "Bypass state",
  "1209": "The function is disabled.",
  "1210": "The defense zone does not support the operation.",
  "1211": "The module address can not be modified.",
  "1212": "The module is unregistered.",
  "1213": "The public subsystem is set to associate with itself.",
  "1214": "The number of subsystems associated with the public subsystem exceeds the max limit.",
  "1215": "The subsystem has been associated with the other public subsystem.",
  "1216": "The defense zone is in the fault state.",
  "1217": "The opening and close of alarm output triggered by event have associated with same event type.",
  "1218": "The defense zone is in the alarm state.",
  "1219": "Short circuit of expansion bus.",
  "1220": "Password conflict.",
  "1221": "Detector gistered by other zone.",
  "1222": "Detector gistered by other PU.",
  "1223": "Detector disconnect.",
  "1224": "Call busy.",
  "1357": "File name error, null or illegal.",
  "1358": "Broadcast busy.",
  "1400": "The number of lanes exceeds the limit.",
  "1401": "License plate recognition region is too large.",
  "1402": "The access parameters of traffic light is error.",
  "1403": "The configuration of lane line is invalid.",
  "1404": "The configuration of stop line is invalid.",
  "1405": "The boundary line configuration of left-turn or right-turn lane is invalid.",
  "1406": "The overlaid lane number is repeated.",
  "1407": "The polygon region of license plate recognition does not meet the requirement.",
  "1408": "The number of traffic lights of the video detection exceeds the max limit.",
  "1409": "The number of the sub traffic lights of video detection is illegal.",
  "1410": "The input area size of the video detection traffic light is illegal.",
  "1411": "The color of the video detection traffic light is illegal.",
  "1412": "The direction of the video detection traffic light is illegal.",
  "1413": "Lack of IO ablity.",
  "1414": "FTP port error.",
  "1415": "FTP catalogue error.",
  "1416": "FTP upload type error.",
  "1417": "Setting param flash write error.",
  "1418": "Getting param flash read error.",
  "1419": "Pic name delimiter error.",
  "1420": "Pic name item error.",
  "1421": "Plate recognize type error.",
  "1422": "Capture times error.",
  "1423": "Loop distance error.",
  "1424": "Loop input status error.",
  "1425": "Related IO conflict.",
  "1426": "Interval time error.",
  "1427": "Sign speed error.",
  "1428": "Flip is used.",
  "1429": "Related lane number error.",
  "1430": "Trigger mode error.",
  "1431": "Delay time error.",
  "1432": "Exceed RS485 count.",
  "1433": "Radar type error.",
  "1434": "Radar angle error.",
  "1435": "Radar speed valid time error.",
  "1436": "Radar line correct error.",
  "1437": "Radar const correct error.",
  "1438": "Record param error.",
  "1439": "Light number and other param error.",
  "1440": "Light number and detection region error.",
  "1441": "Plate recognize Province param error.",
  "1442": "IO Speed TimeOut Param error.",
  "1443": "NTP TimeZone Param error.",
  "1444": "NTP Interval Time error.",
  "1445": "Network Card Num error.",
  "1446": "Default Route error.",
  "1447": "Banding Work Mode error.",
  "1448": "Slave Card error.",
  "1449": "Primary Card error.",
  "1450": "DHCP and PPOE not Meanwhile start.",
  "1451": "Net Interface invalid.",
  "1452": "MTU Param invalid.",
  "1453": "Netmask address invalid.",
  "1454": "IP address invalid.",
  "1455": "Multicast IP address invalid.",
  "1456": "Gateway address invalid.",
  "1457": "DNS Param invalid.",
  "1458": "AlarmHost IP invalid.",
  "1459": "IP address Conflict.",
  "1460": "IP not support Multi Network segment.",
  "1461": "NetPort param error.",
  "1462": "Unsupport PPPOE.",
  "1463": "Not Support Domain Name.",
  "1464": "Speed Not Enabled.",
  "1465": "IO Status invalid.",
  "1466": "Burst Interval invalid.",
  "1467": "Reserve Mode invalid.",
  "1468": "Lane No error.",
  "1469": "Coil Area Type error.",
  "1470": "Trigger Area Param error.",
  "1471": "Speed Limit Param error.",
  "1472": "Lane Protocol Type error.",
  "1473": "Capture Interval Type error.",
  "1474": "Capture Interval Distance error.",
  "1475": "Rs485 Associate DevType error.",
  "1476": "Rs485 Associate LaneNo error.",
  "1477": "LaneNo Associate MulitRs485 error.",
  "1478": "Light Detection Region error.",
  "1479": "UnSupport Capture Frame 2D Noise Reduction.",
  "1480": "UnSupport scene Mode.",
  "1481": "UnSupport White Balance Mode.",
  "1482": "IO Effectiveness invalid.",
  "1483": "Access Detector Lights Red / Yellow Overrun.",
  "1484": "Access Detector Lights Red / Yellow Conflict.",
  "1485": "Trigger straight line error.",
  "1486": "Subject line area stop line error.",
  "1487": "Red light trigger lines error.",
  "1488": "IO out port error.",
  "1489": "IO out ahead time error.",
  "1490": "IO out inwork time error.",
  "1491": "IO out frequency multiplication error.",
  "1492": "IO out duty rate error.",
  "1493": "IO out work mode error.",
  "1494": "Plate enable in plate compensate mode on.",
  "1495": "Recognize Type error.",
  "1496": "Plate Recognize Area Param error.",
  "1497": "Port Conflict.",
  "1498": "IP cannot be the loopback address.",
  "1499": "Driveline sensitivity error.",
  "1500": "The time period conflict.",
  "1501": "The diagnostic plan of VQD dese not exist.",
  "1502": "The channel dese not exist.",
  "1503": "The total number of VQD plans exceeds the max limit.",
  "1504": "The total number of VQD tasks exceeds the max limit.",
  "1600": "Capture times exceed 2 in flash mode.",
  "1601": "Radar type conflict.",
  "1602": "The license plate is null.",
  "1603": "Failed to write data into the database.",
  "1604": "The effective time of licence plate error.",
  "1605": "The pre recorded start time is greater than the number of illegal capture.",
  "1606": "Trigger rule line error.",
  "1607": "Left and right trigger line is not vertical.",
  "1608": "Flash lamp mode error.",
  "1609": "Illegal capture number error.",
  "1610": "Illegal detection type error.",
  "1611": "Positive back to trigger line height error.",
  "1612": "Mixed mode only supports capture type all targets.",
  "1613": "Car sign speed greater than speed limit value.",
  "1614": "Big car sign speed limit greater than speed limit value.",
  "1615": "Big car sign speed limit is greater than the car sign speed limit value.",
  "1616": "Big car speed limit value is greater than the car speed limit value.",
  "1617": "Big car low speed limit value is greater than the car low speed limit value.",
  "1618": "Car speed limit greater than exception high speed value.",
  "1619": "Big car speed limit greater than exception high speed value.",
  "1620": "Stopping more than straight lines trigger lines.",
  "1900": "The time period is overlapped.",
  "1901": "The holiday plan is overlapped.",
  "1902": "The card number is not sorted.",
  "1903": "The card number is not existed.",
  "1904": "The card number is false.",
  "1905": "The zone is armed(the modification of parameters is not allowed)",
  "1906": "The zone does not support the operation.",
  "1907": "Both the multi-door interlocking and anti-sneak configuration are false.",
  "1908": "The card is full(return when up to 10W).",
  "1909": "Holiday group download error.",
  "1910": "Local control off.",
  "1911": "Local control disadd.",
  "1912": "Local control hasadd.",
  "1913": "Local control doorNO conflict.",
  "1914": "Local control communication fail.",
  "1915": "Operand inexistence.",
  "1916": "Local control over limit.",
  "1917": "Door over limit.",
  "1918": "Alarm over limit.",
  "1919": "Local control address inconformity type.",
  "1920": "Device not support one more card.",
  "1921": "NET_ERR_DELETE_NO_EXISTENCE_FACE*/\"Delete no existence face.",
  "1950": "Communication the door machine abnormality.",
  "1951": "Not configured  room no.",
  "1952": "No call.",
  "1953": "Ring the bell.",
  "1954": "Is calling now.",
  "1955": "Intelligent lock password mistake.",
  "1956": "Switch lock failure.",
  "1957": "Switch lock timeout.",
  "1958": "Intelligent lock device is busy.",
  "1959": "Remote lock function is not open.",
  "2100": "The downloaded file is incomplete.",
  "2101": "The IPC has been existed.",
  "2102": "The channel has added one IPC.",
  "2103": "Out of network bandwidth capacity.",
  "2104": "IP conflict between IPC and DVR.",
  "2105": "Illegal IP.",
  "2106": "Illegal port.",
  "2107": "Not in the same WLAN, not support security question config or export GUID.",
  "2108": "Mutual exclusion function error.",
  "2109": "Security question config amount error.",
  "2110": "Face intelligent channel resource has run out.",
  "2111": "Data is Callbacking.",
  "2116": "SMD insufficient encoding resources.",
  "2117": "SMD insufficient decoding resources.",
  "2118": "Facelib data is being processed.",
  "2119": "Too large time difference between device and server.",
  "2120": "Open the playback,this function is not supported.",
  "2121": "The channel has opened SMD,this function is not supported.",
  "2122": "The channel has opened Face snap,this function is not supported.",
  "2123": "The phone number is illegal.",
  "2124": "The certificate number is illegal.",
  "2125": "The resolving power of this chanel is not supported.",
  "2126": "The encoding format of this chanel is not supported.",
  "2146": "Deep learning resources exceed limits.",
  "2153": "The panel mode is not configured.",
  "3001": "Not support Deicing.",
  "3002": "Thermometry is not enabled.",
  "3004": "Panoramic view and position limit can not be operated at the same time.",
  "3005": "SmartH264 and ROI can not be operated at the same time.",
  "3006": "Upper limit of rule number.",
  "3007": "Laser and deicing cannot be operated at the same time.",
  "3008": "Turn off the digital zoom function or set the zoom limit to the minimum."
}
